In [2]:
import numpy as np
import pandas as pd

In [3]:
rows = ['X','Y','Z']

cols = ['A', 'B', 'C', 'D', 'E']

data = np.round(np.random.randn(3,5),2)

In [4]:
df = pd.DataFrame(data, rows, cols)
df

      A     B     C     D     E
X  0.58 -0.54 -0.35 -0.61 -0.34
Y -0.65  1.06  0.57 -0.28 -2.10
Z  0.06 -1.54 -0.56  0.39 -0.96

In [5]:
df > 0.5

       A      B      C      D      E
X   True  False  False  False  False
Y  False   True   True  False  False
Z  False  False  False  False  False

In [6]:
df[df > 0.5]

      A     B     C   D   E
X  0.58   NaN   NaN NaN NaN
Y   NaN  1.06  0.57 NaN NaN
Z   NaN   NaN   NaN NaN NaN

In [7]:
df['C'] < 1

X    True
Y    True
Z    True
Name: C, dtype: bool

In [8]:
df[df['C'] < 1]

      A     B     C     D     E
X  0.58 -0.54 -0.35 -0.61 -0.34
Y -0.65  1.06  0.57 -0.28 -2.10
Z  0.06 -1.54 -0.56  0.39 -0.96

In [9]:
df = pd.DataFrame(np.array([[1, 5, 1],[2, np.nan, 2],[np.nan, np.nan, 3]]))

df.columns = ['A', 'B', 'C']

df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

In [10]:
df.fillna('?')

     A    B    C
0  1.0  5.0  1.0
1  2.0    ?  2.0
2    ?    ?  3.0

In [11]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [12]:
df.fillna(df['A'].mean())

     A    B    C
0  1.0  5.0  1.0
1  2.0  1.5  2.0
2  1.5  1.5  3.0

In [13]:
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

In [14]:
df = pd.DataFrame([ ['Google', 'Sam', 200],

                    ['Google', 'Charlie', 120],

                    ['Salesforce','Ralph', 125],

                    ['Salesforce','Emily', 250],

                    ['Adobe','Rosalynn', 150],

                    ['Adobe','Chelsea', 500]])

df.columns = ['Organization', 'Salesperson Name', 'Sales']

df

  Organization Salesperson Name  Sales
0       Google              Sam    200
1       Google          Charlie    120
2   Salesforce            Ralph    125
3   Salesforce            Emily    250
4        Adobe         Rosalynn    150
5        Adobe          Chelsea    500

In [15]:
df.groupby('Organization').count()

              Salesperson Name  Sales
Organization
Adobe                        2      2
Google                       2      2
Salesforce                   2      2

In [16]:
df.groupby('Organization').max()

             Salesperson Name  Sales
Organization
Adobe                Rosalynn    500
Google                    Sam    200
Salesforce              Ralph    250

In [17]:
df.groupby('Organization').min()

             Salesperson Name  Sales
Organization
Adobe                 Chelsea    150
Google                Charlie    120
Salesforce              Emily    125

In [18]:
df.groupby('Organization').Sales.min()

Organization
Adobe         150
Google        120
Salesforce    125
Name: Sales, dtype: int64

In [19]:
df.groupby('Organization').describe()

             Sales
             count   mean         std    min     25%    50%     75%    max
Organization
Adobe          2.0  325.0  247.487373  150.0  237.50  325.0  412.50  500.0
Google         2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Salesforce     2.0  187.5   88.388348  125.0  156.25  187.5  218.75  250.0

In [20]:
leftDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                     'A': ['A0', 'A1', 'A2', 'A3'],

                     'B': ['B0', 'B1', 'B2', 'B3']})

   

rightDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                          'C': ['C0', 'C1', 'C2', 'C3'],

                          'D': ['D0', 'D1', 'D2', 'D3']})  

leftDataFrame, rightDataFrame

(  key   A   B
 0  K0  A0  B0
 1  K1  A1  B1
 2  K2  A2  B2
 3  K3  A3  B3,
   key   C   D
 0  K0  C0  D0
 1  K1  C1  D1
 2  K2  C2  D2
 3  K3  C3  D3)

In [21]:
pd.merge(leftDataFrame, rightDataFrame, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [22]:
leftDataFrame = pd.DataFrame({  'A': ['A0', 'A1', 'A2', 'A3'],

                                'B': ['B0', 'B1', 'B2', 'B3']},

                                index =['K0', 'K1', 'K2', 'K3'])

   

rightDataFrame = pd.DataFrame({ 'C': ['C0', 'C1', 'C2', 'C3'],

                                'D': ['D0', 'D1', 'D2', 'D3']},

                                index = ['K0', 'K1', 'K2', 'K3']) 
leftDataFrame, rightDataFrame

(     A   B
 K0  A0  B0
 K1  A1  B1
 K2  A2  B2
 K3  A3  B3,
      C   D
 K0  C0  D0
 K1  C1  D1
 K2  C2  D2
 K3  C3  D3)

In [23]:
leftDataFrame.join(rightDataFrame)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [24]:
df = pd.DataFrame({'col1':['A','B','C','D'],

                   'col2':[2,7,3,7],

                   'col3':['fgh','rty','asd','qwe']})
df

  col1  col2 col3
0    A     2  fgh
1    B     7  rty
2    C     3  asd
3    D     7  qwe

In [25]:
df.col2.unique()

array([2, 7, 3], dtype=int64)

In [26]:
df.col2.nunique(), len(df.col2.unique())

(3, 3)

In [27]:
def exponentify(x):
    return x**x

df['col2'].apply(exponentify)

0         4
1    823543
2        27
3    823543
Name: col2, dtype: int64

In [28]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [29]:
df['col2'].apply(lambda x: len(str(x)))

0    1
1    1
2    1
3    1
Name: col2, dtype: int64

In [30]:
df = pd.DataFrame(np.random.randn(50,3))

In [32]:
df.to_csv('my_new_csv.csv', index = False)

In [36]:
import openpyxl

df.to_excel('my_new_excel_file.xlsx', sheet_name='My New Sheet!', index = False)

In [39]:
df_cars = pd.read_csv('https://github.com/UrsaBranca/DataSc/raw/master/Car_price/CarPricePredictions.csv')
df_cars.head()

     ID         Price
0  2022  20952.409784
1  2267  17259.002968
2    45  13487.963679
3  1255  17757.677506
4  1469  18704.432006